	/*
	კომენტარი ხაზგარეშე
	*/
	// კომენტარი ხაზისთვის

#include <iostream> // "#include" ჰედერის შემოსატანად. "iostream" როგორც ბიბლიოთეკის მისამართი
using  namespace std; // "namespace" კოდის რეგიონი; "std" როგორც რეგიონის გამოყენება

/*

"namespace std"_ის გამოყენებით ოპერატორზე "std::" მინიჭება აღარ არის საჭირო. მაგალითად:
std::cout << "ჩემი პირველი პროგრამა\n";

*/

int main() { // "main()" როგორც მთავარი ფუნქცია. "{}" როგორც ფუნქციაში შემავალი შინაარსის მონიშნვა

	cout << "ჩემი პირველი პროგრამა\n"; // "cout" როგორც ფუნქციის გამოტანა. "\n" როგორც ხაზის გაწყვეტა. ";" როგორც კოდის წყვეტა
	
	return 0; // "return" დაბრუნებისთვის
}
