/*
ოპერატორები განსაზღვრავენ ცვლადების მოქმედების მნიშვნელობას.
იმ გამოსახულებების შედეგების სადაც გამოიყენება რელაციური ოპერატორები("true"/"false")

ოპერატორი	მნიშვნელობა
&&		და
||		ან
!		არა (უარყოფა)
*/
#include <iostream>
using namespace std;

int main() {
	
	int i1, i2, i3;

	cout << "შემოიტანეთ i1 ცვლადი:";
	cin >> i1; // "cin" გამოიყენება მნიშვნელობის შემოსატანად
	cout << "შემოიტანეთ i2 ცვლადი:";
	cin >> i2;
	
	if ( i1 > 5 ) cout << "i1 მეტია 5_ზე\n";
	if ( i1 > 5 && i2 < 5 ) cout << "i1 მეტია 5_ზე; i2 ნაკლებია 5_ზე\n";
	if ( i1 > 5 || i2 < 5 ) cout << "ან i1 არის მეტი 5_ზე; ან i2 არის ნაკლები 5_ზე\n";

	// თუ ფუნქციამ არაფერი შინაარსი არ გამოიტანა, ესეიგი დებულება არაჭეშმარიტია

	return 0;
}