#include <iostream>
using namespace std;

int main() {
	
	int i;

	cin >> i;

	switch ( i ) { // "switch" არის გადამრთველი
		case 5: // "case" არის კონტეინერი, თუ მისი მნიშვნელობა დაემთხვა გადამრთველში მითითებულ ცვლას, შესრულდება შემდეგი ოპერაცია
			cout << "i არის 5\n";
			break; // "break" არის მუხრუჭი, რომლიც განასახიერებს კონტეინერის დახურვას (შეჩერებას)
		case 7:
			cout << "i არის 7\n";
			break;
		default: // "default" ნიშნავს ჩვეულს და ის ფუნქციონირებს მაშინ, როდესაც არ დადგინდება არც ერთი კონტეინერის თავსება "swich" გადამრთველში მითითებულ მნიშვნელობაზე
			cout << "შეიყვანეთ 5 ან 7\n";
	}

	return 0;
}
