#include <iostream>
using namespace std;

int main() {
	
	int i = 10;

	while ( i > 0 ) { // "while" ნიშნავს სადაც_ს. მასში შეტანილი ფუნქციით დგინდება მასში შემავალი კოდის მუშაობის პრინციპი.

			cout << i << "\n";
			i--;
	}

	return 0;
}

/*
"while ( i > 0 )"_ის ნაცვლად შესაძლებელია ჭეშმარიტობის ფუნქციის ("true"/"false" ან "0"/0-*~0+*) გამოყენებაც. მაგალითად ყოველი "0"_ისგან განსხვავებული რიცხვი აღიქმება როგორც ჭეშმარიტი, ხოლო "0" კი შეესატყვისება მცდარ დებულებას. იხილეთ მაგალითი:

	int i = 10;

	while ( i ) { // სადაც "i" არ არის "0"

			cout << i << "\n";
			i--;
	}

*/
