#include <iostream>
using namespace std;

/*
"while" ფუნქციის ორმაგი გამოყენება
*/

int main() {
	
	int i, j;
	j = 1;
	while ( j <= 10  ) { // პირველი პირობა. "j" ცვლადი გამოიყენება პირველი ფუნქციის ლიმიტირებისთვის, თუ როგორ გამოიტანოს მასში არსებული მეორე პირობა
		i = 1; // "i" ცვლადის შეტანა ხდება "while" ფუნქციის ტანში, რადგან მისი მის გარეთ არსებობის შემთხვევაში საჭიროებს პოინტერების გამოყენებას
		while ( i <= 10 ) { // მეორე პირობა
			cout << i << " ";
			i++; // მეორე პირობის ზრდადობისთვის, რათა მოხდეს პირობის ზრდადობა და არ გაიყონოს ერთ მოცემულ ვარიანტზე
		}
		cout << "\n"; // ყოველი მეორე პირობის დასრულების შემდეგ მოხდეს ახალ ხაზზე გამოტანა
		j++; // ზრდადობა პირველი პირობისთვის, რათა გაიზდოს მეტობით ყოველ ჯერზე ("i++" სანამ არ გახდება 10)
	}

	return 0;
}