#include <iostream>
#include <cstdlib> // "cstdlib" ბიბლიოთეკა "rand" ფუნქციისთვის
using namespace std;

int main() {

	int array[5][10]; // თუ ცვლადს აქვს დამატებული "[ ][ ]". ეს ნიშნავს იმას, რომ ცვლადი არის ორგანზომილებიანი მასივი

	for ( int x = 0; x < 5; x++ ) {
		for ( int y = 0; y < 10; y++ ) {
			array[ x ][ y ] = (rand()%10); // "(rand()%10)" ფუნქცია გამოიყენება შემთხვევითი აირჩეს რიცხვი, სადაც "10" ნიშნავს ათამდეს
			cout << array[ x ][ y ] << " ";
		}
	cout << "\n";
	}
	return 0;
}

/*

ორგანზომილებიან მასივი იმართება "[ ] [ ]", სადაც პირველი("[ ]") შეადგენს სტრიქონის ( _ ) რაოდენობას, ხოლო მეორე სვეტების( | ) რაოდენობას. ასევე აღსანიშნია ის ფაქტიც, რომ ცვლადის რიცხვითი მნიშვნელობის როლი იწყება ნულიდან.

რიცხვითი მაგალითი ერთგანზომილებიან მასივში გამოიყურება:
0 1 2 3 4 5 6 7 8 9

რიცხვითი მაგალითი ორგანზომილებიან მასივში გამოიყურება:
-სადაც პირველი რიცხვი შეადგენს სტრიქონს, ხოლო მეორე კი სვეტს
00 01 02 03 04
10 11 12 13 14
20 21 22 23 24
30 31 32 33 34

ამ მაგალითით შეგიძლიათ ამოიღოთ კონკრეტული მნიშვნელობა "კოორდინატის" მითითებით

*/
