#include <iostream>
using namespace std;

int main() {
	/*
	ერთგანზომილებიან მასივში"[ ]" რაოდენობის მინიჭების არ შეტნით( "array[10]'' ის ნაცვლად "array[ ]") ფუნქცია თავისით გაანალიზებს მასში შეტანილი მნიშვნელობების რაოდენობას
	*/
	int arraya[ ] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9}; // მასივში საწყისი მნიშვნელობის ინიციალიზება ხდება "{}" ოპერატორებით, ხოლო მასში არსებული მნიშვნელობები გამოიყოფა ","_ით

	int arrayb[3][10] = { // ორგანზომილებიანი ცვლადის ინიზიალიზება ხდება ორმაგი"{}"_ის გამოყენებით("{{0,1,2,3},{0,1,2,3},{0,1,2,3}};")
		{0, 1, 2, 3, 4, 5, 6, 7, 8, 9},
		{0, 1, 2, 3, 4, 5, 6, 7, 8, 9},
		{0, 1, 2, 3, 4, 5, 6, 7, 8, 9}
	};

	cout << "ერთგანზომილებიანი მასივი:\n";
	for ( int y = 0; y < 1; y++ ) {
		for ( int x = 0; x < 10; x++ ) {
			cout << arraya[ x ] << " ";
		}
	cout << "\n";

	cout << "ორგანზომილებიანი მასივი:\n";
	}
	for ( int y = 0; y < 3; y++ ) {
		for ( int x = 0; x < 10; x++ ) {
			cout << arrayb[ x ][ y ] << " ";
		}
	cout << "\n";
	}

	return 0;
}