#include <iostream>
using namespace std;

int main() {
	
	int i = 0;
	int j = 5;

	i = i+1; // "i" ცვლადი ტოლია თავის თავს დამატებული ერთის
	cout << "i+1=" << i << "\n";
	
	i++; // "++" გამოიყენება ზრდადობისთვის("i"_ს დამატებული...)
	cout << "i++ " << i << "\n";

	++i; // "++" გამოიყენება ზრდადობისთვის("i" დამატებული...)
	cout << "++i " << i << "\n";

	cout << "\n";

	j= j-1; // "i" ცვლადი ტოლია თავის თავს გამოკლებული ერთის
	cout << "i+1=" << j << "\n";
	
	j--; // "++" გამოიყენება გამოკლებისთვის("i"_ს გამოკლებული...)
	cout << "j-- " << j << "\n";

	--j; // "++" გამოიყენება გამოკლებისთვის("i" გამოკლებული...)
	cout << "--j " << j << "\n";

	return 0;
}